# CanOffsetFace Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Part..::..CanOffsetFace Method
Part Class See Also
---
Checks if it is possible to offset the given face.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public bool CanOffsetFace(
	Face face
)
```

Visual Basic
---
```text
Public Function CanOffsetFace ( _
	face As Face _
) As Boolean
```

Visual C++
---
```text
public:
bool CanOffsetFace(
	Face^ face
)
```

# ### Parameters
face
    Type: Autodesk.Revit.DB..::..Face face to be checked.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
Part Class
Autodesk.Revit.DB Namespace